SysMC/cpp-mbee/examples/MSP430/boards/MSP-EXP430FR2355/MSP-EXP430FR2355_Software_Examples/Firmware/Source/Control/Control.cpp
//*****************************************************************************
//
//! \brief Инициализация всех линий ввода/вывода и периферийных модулей.
//!
//! \return NONE
//
//*****************************************************************************
void hardwareInit(void)
{
  GPIO_setAsPeripheralModuleFunctionInputPin(GPIO_PORT_XIN, GPIO_PIN_XIN + GPIO_PIN_XOUT, GPIO_FUNCTION_XIN); //Настраиваем выводы, к которым подключен кварцевый резонатор 32768 Гц.
  GPIO_setAsPeripheralModuleFunctionInputPin(MBEE_UART_PORT_NUM, MBEE_UART_RX_BIT_NUM, GPIO_FUNCTION_UCA0RXD); //Настройка выводов, используемых модулем UART для соединения с радиомодулем MBee.
  GPIO_setAsPeripheralModuleFunctionOutputPin(MBEE_UART_PORT_NUM, MBEE_UART_TX_BIT_NUM, GPIO_FUNCTION_UCA0TXD);
  #if defined(ENABLE_CONSOLE)
    GPIO_setAsPeripheralModuleFunctionInputPin(CONSOLE_UART_PORT_NUM, CONSOLE_UART_RX_BIT_NUM, GPIO_FUNCTION_CONSOLE_UCAxRXD); //Настройка выводов, используемых модулем UART для организации консоли.
    GPIO_setAsPeripheralModuleFunctionOutputPin(CONSOLE_UART_PORT_NUM, CONSOLE_UART_TX_BIT_NUM, GPIO_FUNCTION_CONSOLE_UCAxTXD);
  #endif
  GPIO_setOutputLowOnPin(GPIO_PORT_LAMP1, GPIO_PIN_LAMP1); //Настройка вывода, управляющего первым светодиодом.
  GPIO_setAsOutputPin(GPIO_PORT_LAMP1, GPIO_PIN_LAMP1);
  GPIO_setOutputLowOnPin(GPIO_PORT_LAMP2, GPIO_PIN_LAMP2); //Настройка вывода, управляющего первым светодиодом.
  GPIO_setAsOutputPin(GPIO_PORT_LAMP2, GPIO_PIN_LAMP2);
  GPIO_setAsInputPinWithPullUpResistor(GPIO_PORT_BUTTON1, GPIO_PIN_BUTTON1); //Настраиваем, вывод, к которому подключена первая кнопка.
  GPIO_enableInterrupt(GPIO_PORT_BUTTON1, GPIO_PIN_BUTTON1);
  GPIO_selectInterruptEdge(GPIO_PORT_BUTTON1, GPIO_PIN_BUTTON1, GPIO_HIGH_TO_LOW_TRANSITION);
  GPIO_clearInterrupt(GPIO_PORT_BUTTON1, GPIO_PIN_BUTTON1);
  GPIO_setAsInputPinWithPullUpResistor(GPIO_PORT_DIP1, GPIO_PIN_DIP1); //Настраиваем, вывод, к которому подключен первый контакт DIP-переключателя.
  GPIO_enableInterrupt(GPIO_PORT_DIP1, GPIO_PIN_DIP1);
  GPIO_selectInterruptEdge(GPIO_PORT_DIP1, GPIO_PIN_DIP1, GPIO_HIGH_TO_LOW_TRANSITION);
  GPIO_clearInterrupt(GPIO_PORT_DIP1, GPIO_PIN_DIP1);
  GPIO_setAsPeripheralModuleFunctionInputPin(GPIO_PORT_POTENTIOMETER, GPIO_PIN_POTENTIOMETER, GPIO_TERNARY_MODULE_FUNCTION); //Настройка входа, к которому подключен потенциометр.
  PMM_unlockLPM5(); //Активируем настройки портов.

  CS_turnOnXT1LFWithTimeout(CS_XT1_DRIVE_3 , CS_XT1_TIMEOUT); //Включение кварцевого генератора с самым высоким усилением и, соответственно, с самой высокой помехоустойчивостью и более высоким потреблением.
  CS_initClockSignal(CS_FLLREF, CS_XT1CLK_SELECT, CS_CLOCK_DIVIDER_1 ); //В качестве источника тактового сигнала DCO выбираем кварцевый генератор 32768 Гц без входного деления частоты.
  CS_initFLL(CS_MCLK_DESIRED_FREQUENCY_IN_KHZ, CS_MCLK_FLLREF_RATIO); //Устанавливаем требуемую частоту сигнала DCO. Эта же функция выбирает DCO как источник и MCLK и SMCLK. Для работы библиотеки cpp-mbee требуется,чтобы тактовая частота SMCLK была равной 8 МГц.
  CS_initClockSignal(CS_ACLK, CS_XT1CLK_SELECT, CS_CLOCK_DIVIDER_1); //Для примера для ACLK выбираем кварцевый генератор 32768 Гц.

  //Настройка таймера Timer1_B3, используемого для формирования задержек. Настройка осуществляется только частично так как старт таймера и часть настроек будет выполняться непосредственно в функциях задержки.
  Timer_B_initUpModeParam timerbConfig = {0};
  timerbConfig.clockSource = TIMER_B_CLOCKSOURCE_SMCLK;
  timerbConfig.clockSourceDivider = TIMER_B_CLOCKSOURCE_DIVIDER_8; //Тактовую частоту Timer1_B3 устанавливаем равной 1 МГц.
  Timer_B_initUpMode(TIMER_B1_BASE, &timerbConfig);

  //Настройка АЦП.
  ADC_init(ADC_BASE, ADC_SAMPLEHOLDSOURCE_SC, ADC_CLOCKSOURCE_ADCOSC, ADC_CLOCKDIVIDER_1);
  ADC_enable(ADC_BASE);
  ADC_setupSamplingTimer(ADC_BASE, ADC_CYCLEHOLD_16_CYCLES, ADC_MULTIPLESAMPLESDISABLE);
  ADC_setResolution(ADC_BASE, ADC_RESOLUTION);
  ADC_configureMemory(ADC_BASE, ADC_INPUT_A5, ADC_VREFPOS_INT, ADC_VREFNEG_AVSS);
  ADC_clearInterrupt(ADC_BASE, ADC_COMPLETED_INTERRUPT);
  PMM_enableInternalReference();
  PMM_selectVoltageReference(PMM_REFVSEL_1_5V);
  while(PMM_REFGEN_NOTREADY == PMM_getVariableReferenceVoltageStatus()) ;
}

//*****************************************************************************
//
//! \brief Включает требуемый светодиод заданное число раз.
//!
//! \param led Код цвета светодиода.
//! \param count Число включений светодиода.
//!
//! \return NONE
//
//*****************************************************************************
void ledBlinking(uint8_t led, uint8_t count)
{
  while(count--)
  {
    switch(led)
    {
      case RED:
        GPIO_setOutputHighOnPin(GPIO_PORT_LAMP1, GPIO_PIN_LAMP1);
        delayMs(LED_ON_TIME);
        GPIO_setOutputLowOnPin(GPIO_PORT_LAMP1, GPIO_PIN_LAMP1);
        delayMs(LED_ON_TIME);
      break;
      case GREEN:
        GPIO_setOutputHighOnPin(GPIO_PORT_LAMP2, GPIO_PIN_LAMP2);
        delayMs(LED_ON_TIME);
        GPIO_setOutputLowOnPin(GPIO_PORT_LAMP2, GPIO_PIN_LAMP2);
        delayMs(LED_ON_TIME);
      break;
    }
  }
}

//*****************************************************************************
//
//! \brief Установка рабочего цикла ШИМ в зависимости от положения потенциометра.
//!
//! \return true, если текущее значение изменилось более, чем на заданную величину.
//
//*****************************************************************************
bool potentiometerPoll(void)
{
  bool status = false;
  int16_t delta;
  uint16_t currentPotentiometerBrigthnessSetting;
  ADC_startConversion(ADC_BASE, ADC_SINGLECHANNEL);
  while(!ADC_getInterruptStatus(ADC_BASE, ADC_COMPLETED_INTERRUPT_FLAG));
  currentPotentiometerBrigthnessSetting = ((long)ADC_getResults(ADC_BASE) * PWM_DUTY_CYCLE_MAX)/((0x0FFF >> (4 - (ADC_RESOLUTION >> 3))) - 1);
  delta = potentiometerBrigthnessSetting - currentPotentiometerBrigthnessSetting;
  if(delta < 0)
  {
    delta = - delta;
  }
  if(delta >= (PWM_DUTY_CYCLE_MAX / 100) * POTENTIOMETER_SENSITIVITY) //Проверяем, превышает ли разность между установленным уровенем яркости и текущим порог чувствительности.
  {
    potentiometerBrigthnessSetting = currentPotentiometerBrigthnessSetting;
    status = true;
  }
  return status;
}

//*****************************************************************************
//
//! \brief Задержка микроcекундного диапазона.
//!
//! Обеспечивает thread-безопасную задержку миллисекундного диапазона. Использует
//! таймер Timer1_B3.
//!
//! \param us Микросекунды.
//!
//! \return NONE
//
//*****************************************************************************
void delayUs(uint16_t us)
{
  uint16_t intState;
  uint16_t count = us/MAX_DELAY_US;
  if(us)
  {
    TB1CTL &= ~(MC_1 | MC_2); //Останавливаем таймер на случай, если он был включен.
    TB1CTL |= TBCLR; //Сбрасываем TB0 и делители.
    TB1CCR0 = (MAX_DELAY_US - 1);
    TB1CTL |= MC__UP; //Запускаем таймер в UP mode.
    TB1CCTL0 &= ~CCIFG;
    do
    {
      ENTER_CRITICAL_SECTION(intState);
      while(!(TB1CCTL0 & CCIFG));
      TB1CCTL0 &= ~CCIFG;
      EXIT_CRITICAL_SECTION(intState);
    }while(count--);
    TB1CTL &= ~(MC_1 | MC_2);
  }
}

//*****************************************************************************
//
//! \brief Задержка миллиcекундного диапазона.
//!
//! Обеспечивает thread-безопасную задержку миллисекундного диапазона. Использует
//! таймер Timer1_B3.
//!
//! \param ms Миллисекунды.
//!
//! \return NONE
//
//*****************************************************************************
void delayMs(unsigned int ms)
{
  while(ms)
  {
    delayUs(1000);
    ms--;
  }
}

//*****************************************************************************
//
//! \brief Обработка прерываний при изменении уровня на входах порта 2.
//!
//! \return NONE
//
//*****************************************************************************
#if defined(__TI_COMPILER_VERSION__) || defined(__IAR_SYSTEMS_ICC__)
#pragma vector=PORT2_VECTOR
__interrupt
#elif defined(__GNUC__)
__attribute__((interrupt(PORT2_VECTOR)))
#endif
void P2_ISR (void)
{
  switch(__even_in_range(P2IV, 16))
  {
    case 0x00: // Vector 0 - No interrupt pending
      break;
    case 0x02: // Vector 2 - Interrupt Source: P2.0
      break;
    case 0x04: // Vector 4 - Interrupt Source: P2.1
      break;
    case 0x06: // Vector 6 - Interrupt Source: P2.2
      SET_EVENT(DIP1_CHANGE_EVENT);
      if(GPIO_getInputPinValue(GPIO_PORT_DIP1, GPIO_PIN_DIP1) == GPIO_INPUT_PIN_LOW) //Меняем активный фронт прерывания на противоположный.
      {
        GPIO_selectInterruptEdge(GPIO_PORT_DIP1, GPIO_PIN_DIP1, GPIO_LOW_TO_HIGH_TRANSITION);
      }
      else
      {
        GPIO_selectInterruptEdge(GPIO_PORT_DIP1, GPIO_PIN_DIP1, GPIO_HIGH_TO_LOW_TRANSITION);
      }
      break;
    case 0x08: // Vector 8 - Interrupt Source: P2.3
      break;
    case 0x0A: // Vector 10 - Interrupt Source: P2.4
      break;
    case 0x0C: // Vector 12 - Interrupt Source: P2.5
      break;
    case 0x0E: // Vector 14 - Interrupt Source: P2.6
      break;
    case 0x10: // Vector 16 - Interrupt Source: P2.7
      break;
  }
}

//*****************************************************************************
//
//! \brief Обработка прерываний при изменении уровня на входах порта 4.
//!
//! \return NONE
//
//*****************************************************************************
#if defined(__TI_COMPILER_VERSION__) || defined(__IAR_SYSTEMS_ICC__)
#pragma vector=PORT4_VECTOR
__interrupt
#elif defined(__GNUC__)
__attribute__((interrupt(PORT4_VECTOR)))
#endif
void P4_ISR (void)
{
  switch(__even_in_range(P4IV, 16))
  {
    case 0x00: // Vector 0 - No interrupt pending
      break;
    case 0x02: // Vector 2 - Interrupt Source: P4.0
      break;
    case 0x04: // Vector 4 - Interrupt Source: P4.1
      break;
    case 0x06: // Vector 6 - Interrupt Source: P4.2
      break;
    case 0x08: // Vector 8 - Interrupt Source: P4.3
      break;
    case 0x0A: // Vector 10 - Interrupt Source: P4.4
      break;
    case 0x0C: // Vector 12 - Interrupt Source: P4.5
      break;
    case 0x0E: // Vector 14 - Interrupt Source: P4.6
      break;
    case 0x10: // Vector 16 - Interrupt Source: P4.7
      SET_EVENT(BUTTON1_PRESSED_EVENT);
      break;
  }
}

